huskyroboticsteam/OrpheusElectronics/Psoc Arm/Design01.cydsn/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "Pin_Limit_1.h"
#include "Pin_Limit_1_aliases.h"
#include "Pin_Limit_2.h"
#include "Pin_Limit_2_aliases.h"
#include "PWM_Motor.h"
#include "isr_Limit_1.h"
#include "isr_Limit_2.h"
#include "Pin_Motor.h"
#include "Pin_Motor_aliases.h"
#include "Clock_PWM.h"
#include "Pin_Direction.h"
#include "Pin_Direction_aliases.h"
#include "Pin_debug.h"
#include "Pin_debug_aliases.h"
#include "QuadDec.h"
#include "Pin_Encoder_A.h"
#include "Pin_Encoder_A_aliases.h"
#include "Pin_Encoder_B.h"
#include "Pin_Encoder_B_aliases.h"
#include "Clock_1.h"
#include "Pin_count_10.h"
#include "Pin_count_10_aliases.h"
#include "Pin_count_20.h"
#include "Pin_count_20_aliases.h"
#include "Pin_count_neg_10.h"
#include "Pin_count_neg_10_aliases.h"
#include "Pin_count_neg_20.h"
#include "Pin_count_neg_20_aliases.h"
#include "Status_Reg_Switches.h"
#include "Clock_2.h"
#include "QuadDec_Cnt16.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyDMA.h"
#include "CyLFClk.h"
#include "cy_em_eeprom.h"

/*[]*/

